# Dados Absolutos e Relativos

### Dados Absolutos
* Coleta direta da fonte sem nenhum tipo de manipulação
* Somente Contagem, Ordenação

### Dados Relativos
* Fácil entendimento para ajudar nas comparações entre quantidades
* Podendo ser visualizados por
    * Porcentagem
        * Destacar a participação de uma parte em um todo - Comparativos
    * Indices
        * Razão entre duas grandezas
        * Resumir em um só número o comportamento geral de uma variável
    * Coeficientes
        * Razões entre o número de ocorrências e o número total
    * Taxas
        * Coeficientes multiplicados por uma potência de 10 (10, 100, 1000)

In [1]:
import pandas as pd

#### Percentuais
* Exemplo

In [6]:
dados = {
    'emprego': ['Administrador_BD', 'Programador', 'Arquiteto_Redes'],
    'nova_jersey': [97350, 82080, 112840],
    'florida': [77140, 71540, 62310]
}
df = pd.DataFrame(data=dados)
df

            emprego  nova_jersey  florida
0  Administrador_BD        97350    77140
1       Programador        82080    71540
2   Arquiteto_Redes       112840    62310

In [7]:
# Totais de Empregos em cada cidade
df['nova_jersey'].sum(), df['florida'].sum()

(292270, 210990)

In [8]:
df['%_nova_jersey'] = (df['nova_jersey'] / df['nova_jersey'].sum()) * 100
df

            emprego  nova_jersey  florida  %_nova_jersey
0  Administrador_BD        97350    77140      33.308242
1       Programador        82080    71540      28.083621
2   Arquiteto_Redes       112840    62310      38.608136

In [9]:
df['%_florida'] = (df['florida'] / df['florida'].sum()) * 100
df

            emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Administrador_BD        97350    77140      33.308242  36.560974
1       Programador        82080    71540      28.083621  33.906820
2   Arquiteto_Redes       112840    62310      38.608136  29.532205

* Exemplo 2 - Dados carregados da pasta 'Bases de Dados', planilha 'census.csv'

In [19]:
census_df = pd.read_csv('./Bases de dados/census.csv')
census_df.shape

(32561, 15)

In [20]:
census_df.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [24]:
census_df_2 = census_df[['education', 'income']]
census_df_2.head()

    education  income
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [31]:
census_df_3 = census_df_2.groupby(['education', 'income'])['education'].count()
census_df_3.head()

education  income
 10th       <=50K     871
            >50K       62
 11th       <=50K    1115
            >50K       60
 12th       <=50K     400
Name: education, dtype: int64

In [35]:
census_df_3[' Bachelors', ' <=50K'], census_df_3[' Bachelors', ' >50K']

(3134, 2221)

In [36]:
3134 + 2221

5355

In [39]:
# % de <=50K
(3134 / 5355) * 100

58.52474323062559

In [40]:
(2221 / 5355) * 100

41.47525676937442

### Exemplo Coeficientes e Taxas
Calcular o coeficiente e a taxa de evasão utilizando o DataFrame abaixo.

In [7]:
dados = {
    'ano': ['1','2','3','4','Total'],
    'matricula_marco': [70,50,47,23,190],
    'matricula_novembro': [65,48,40,22,175]
}
dados

{'ano': ['1', '2', '3', '4', 'Total'],
 'matricula_marco': [70, 50, 47, 23, 190],
 'matricula_novembro': [65, 48, 40, 22, 175]}

In [8]:
dataset = pd.DataFrame(data=dados)
dataset

     ano  matricula_marco  matricula_novembro
0      1               70                  65
1      2               50                  48
2      3               47                  40
3      4               23                  22
4  Total              190                 175

In [9]:
dataset['taxa_evasao'] = ((dataset['matricula_marco'] - dataset['matricula_novembro']) / dataset['matricula_marco']) * 100

In [10]:
dataset

     ano  matricula_marco  matricula_novembro  taxa_evasao
0      1               70                  65     7.142857
1      2               50                  48     4.000000
2      3               47                  40    14.893617
3      4               23                  22     4.347826
4  Total              190                 175     7.894737